---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingDoublyConnected
source: html/286a6f0f-7296-8980-6ac0-e56a98d8a937.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingDoublyConnected Property

Railings hosted on Stairs must form a single, open, connected line.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailingDoublyConnected { get; }
```